tests/feedback-service/load.yml
config:
  environments:
    dev:
      target: 'https://feedback-service.adsp-dev.gov.ab.ca'
    uat:
      target: 'https://feedback-service.adsp-uat.alberta.ca'

  # Processor handles Keycloak authentication + token caching
  processor: ./processor.mjs

  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'

  # CSV payload containing Keycloak + tenant + user credentials
  payload:
    - path: './artillery.{{ $environment }}.csv'
      skipHeader: true
      fields:
        - 'keycloak_url'
        - 'realm_id'
        - 'tenant_name'
        - 'client_id'
        - 'username'

  # Load phases
  phases:
    - name: warm up
      duration: 10
      arrivalCount: 20

    - name: load
      duration: 1200
      arrivalCount: 10000

scenarios:
  - name: Submit a new comment to the artillery test website
    weight: 1
    beforeScenario: beforeScenario

    flow:
      # POST request to create feedback entry
      - post:
          url: '/feedback/v1/feedback'
          headers:
            authorization: 'Bearer {{ token }}'
          json:
            tenant: autotest
            context:
              site: https://artillerty-load-test.com
              view: string
            rating: terrible
            comment: artillery test