tests/feedback-service/load.yml
config:
  environments:
    dev:
      target: 'https://feedback-service.adsp-dev.gov.ab.ca'
    uat:
      target: 'https://feedback-service.adsp-uat.alberta.ca'
  defaults:
    headers:
      Content-Type: 'application/json'
      Accept: 'application/json'
  payload:
    - path: '../artillery.{{ $environment }}.csv'
      skipHeader: true
      fields:
        - 'keycloak_url'
        - 'realm_id'
        - 'tenant_name'
        - 'client_id'
  phases:
    - name: warm up
      duration: 2
      arrivalCount: 22
    - name: load
      duration: 2
      arrivalCount: 2
before:
  flow:
    - log: 'Getting the access token (tenant: {{ realm_id }}) for client {{ client_id }}'
    - post:
        url: '{{ keycloak_url }}/auth/realms/{{ realm_id }}/protocol/openid-connect/token'
        headers:
          Content-Type: 'application/x-www-form-urlencoded'
          Accept: 'application/json'
        form:
          {
            grant_type: 'client_credentials',
            client_id: '{{ client_id }}',
            client_secret: '{{ $processEnvironment.ARTILLERY_CLIENT_SECRET }}',
          }
        capture:
          - json: '$.access_token'
            as: token
scenarios:
  - name: Submit a new comment to the artillery test website
    weight: 1
    flow:
      - post:
          url: '/feedback/v1/feedback'
          headers:
            authorization: 'Bearer {{ token }}'
          json:
            tenant: autotest
            context:
              site: https://artillerty-load-test.com
              view: string
            rating: terrible
            comment: artillery test